# Pandas I - Series and DataFrame

Pandas introduces two new data structures to Python, both of which are built on top of [NumPy](this means it's fast) :
- [Series] : one-dimensional object akin to an observation/row in a dataset
- [DataFrame] : tabular data structure akin to a database table

In [1]:
import pandas as pd
import numpy as np
pd.set_option('max_columns', 50)

## Summary

1. [Series](#1.-Series)<br>
    1.1 Creating<br>
    1.2 Selecting<br>
    1.3 Editing<br>
    1.3 Mathematical Operations<br>
    1.3 Missing Values
2. [DataFrame](#2.-DataFrame)<br>
    2.1 From Dictionnary of Lists<br>
    2.2 From/To CSV<br>
    2.3 From/To Excel<br>
    2.4 From/To Database<br>
    2.5 From Clipboard<br>
    2.6 From URL<br>
    2.7 From Google Analytics API
3. [Merge](#3.-Merge)<br>
    3.1 Inner Join (default)<br>
    3.2 Left Outer Join<br>
    3.3 Right Outer Join<br>
    3.4 Full Outer Join<br>
4. [Concatenate](#4.-Concatenate)

## 1. Series

A Series is a one-dimensional object similar to an array, list, or column in a table.<br>
It will assign a labeled index to each item in the Series. By default, each item will receive an index label from 0 to N, where N is the length of the Series minus one.

### 1.1 Creating

In [2]:
# create a Series with an arbitrary list
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'])
s

0                7
1       Heisenberg
2             3.14
3      -1789710578
4    Happy Eating!
dtype: object

In [3]:
s[4]

'Happy Eating!'

Alternatively, you can specify an index to use when creating the Series.

In [4]:
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'],
              index=['A', 'Z', 'C', 'Y', 'E'])
s

A                7
Z       Heisenberg
C             3.14
Y      -1789710578
E    Happy Eating!
dtype: object

In [5]:
s['Y']

-1789710578

In [6]:
?pd.Series

The Series constructor can convert a dictonary as well, using the keys of the dictionary as its index.

In [7]:
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
d

{'Chicago': 1000,
 'New York': 1300,
 'Portland': 900,
 'San Francisco': 1100,
 'Austin': 450,
 'Boston': None}

In [8]:
cities = pd.Series(d)
cities

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
Boston              NaN
dtype: float64

### 1.2 Selecting

You can use the index to select specific items from the Series ...

In [9]:
cities['Austin']

450.0

In [10]:
cities[['Chicago', 'Portland', 'San Francisco']]

Chicago          1000.0
Portland          900.0
San Francisco    1100.0
dtype: float64

In [11]:
cities['Chicago']

1000.0

In [12]:
cities < 1000

Chicago          False
New York         False
Portland          True
San Francisco    False
Austin            True
Boston           False
dtype: bool

Or you can use boolean indexing for selection.

In [13]:
cities[cities < 1000]

Portland    900.0
Austin      450.0
dtype: float64

That last one might be a little weird, so let's make it more clear - `cities < 1000` returns a Series of True/False values, which we then pass to our Series `cities`, returning the corresponding True items.

In [14]:
less_than_1000 = cities < 1000

In [15]:
print(less_than_1000)

Chicago          False
New York         False
Portland          True
San Francisco    False
Austin            True
Boston           False
dtype: bool

In [16]:
cities[less_than_1000]

Portland    900.0
Austin      450.0
dtype: float64

### 1.3 Editing

You can also change the values in a Series on the fly.

In [17]:
# changing based on the index
print ('Old value:', cities['Chicago'])
cities['Chicago'] = 1400
print ('New value:', cities['Chicago'])

Old value: 1000.0
New value: 1400.0

In [18]:
# changing values using boolean logic
print (cities[cities < 1000])
print ('\n')
print ('\n')
print ('\n')
print ('\n')

cities[cities < 1000] = 750

print (cities[cities < 1000])

Portland    900.0
Austin      450.0
dtype: float64








Portland    750.0
Austin      750.0
dtype: float64

In [19]:
cities

Chicago          1400.0
New York         1300.0
Portland          750.0
San Francisco    1100.0
Austin            750.0
Boston              NaN
dtype: float64

### 1.4 Mathematical Operations
Mathematical operations can be done using scalars and functions.

In [20]:
# divide city values by 3
cities / 3

Chicago          466.666667
New York         433.333333
Portland         250.000000
San Francisco    366.666667
Austin           250.000000
Boston                  NaN
dtype: float64

In [21]:
cities

Chicago          1400.0
New York         1300.0
Portland          750.0
San Francisco    1100.0
Austin            750.0
Boston              NaN
dtype: float64

In [22]:
# square city values
np.square(cities)

Chicago          1960000.0
New York         1690000.0
Portland          562500.0
San Francisco    1210000.0
Austin            562500.0
Boston                 NaN
dtype: float64

You can add two Series together, which returns a union of the two Series with the addition occurring on the shared index values.  Values on either Series that did not have a shared index will produce a NULL/NaN (not a number).

In [23]:
print (cities[['Chicago', 'New York', 'Portland']])
print('\n')
print (cities[['Austin', 'New York']])
print('\n')
print (cities[['Chicago', 'New York', 'Portland']] + cities[['Austin', 'New York']])

Chicago     1400.0
New York    1300.0
Portland     750.0
dtype: float64


Austin       750.0
New York    1300.0
dtype: float64


Austin         NaN
Chicago        NaN
New York    2600.0
Portland       NaN
dtype: float64

In [24]:
x= cities[['Chicago', 'New York', 'Portland']]
x

Chicago     1400.0
New York    1300.0
Portland     750.0
dtype: float64

In [25]:
y = (cities[['Austin', 'New York']])
y

Austin       750.0
New York    1300.0
dtype: float64

In [26]:
x + y

Austin         NaN
Chicago        NaN
New York    2600.0
Portland       NaN
dtype: float64

Notice that because Austin, Chicago, and Portland were not found in both Series, they were returned with NULL/NaN values.

### 5. Missing Values

What if you aren't sure whether an item is in the Series?  You can check using idiomatic Python.

In [27]:
print ('Seattle' in cities)
print ('San Francisco' in cities)

False
True

NULL checking can be performed with `isnull` and `notnull`.

In [28]:
# returns a boolean series indicating which values aren't NULL
cities.notnull()

Chicago           True
New York          True
Portland          True
San Francisco     True
Austin            True
Boston           False
dtype: bool

In [29]:
[cities.isnull()]

[Chicago          False
 New York         False
 Portland         False
 San Francisco    False
 Austin           False
 Boston            True
 dtype: bool]

In [30]:
# use boolean logic to grab the NULL cities
print (cities.isnull())
print ('\n')
print (cities[cities.isnull()])

Chicago          False
New York         False
Portland         False
San Francisco    False
Austin           False
Boston            True
dtype: bool


Boston   NaN
dtype: float64

## 2. DataFrame

A DataFrame is a tabular data structure comprised of rows and columns, akin to a spreadsheet, database table, or R's data.frame object. You can also think of a DataFrame as a group of Series objects (rows) that share an index (the column names).

### 2.1 From Dictionnary of Lists

To create a DataFrame out of common Python data structures, we can pass a **dictionary of lists** to the DataFrame constructor.
Using the `columns` parameter allows us to tell the constructor how we'd like the columns ordered. By default, the DataFrame constructor will order the columns alphabetically (though this isn't the case when reading from a file - more on that next).

In [31]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}

data

{'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
 'team': ['Bears',
  'Bears',
  'Bears',
  'Packers',
  'Packers',
  'Lions',
  'Lions',
  'Lions'],
 'wins': [11, 8, 10, 15, 11, 6, 10, 4],
 'losses': [5, 8, 6, 1, 5, 10, 6, 12]}

In [32]:
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])
print(football)

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [33]:
data2 = pd.DataFrame(data)
data2

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

# Pandas II - Working with DataFrames

In [35]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

pd.set_option('max_columns', 50)


#data = pd.read_csv('/Users/apple1/OneDrive/Python Training/P')

In [39]:
# pass in column names for each CSV
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
df_users = pd.read_csv('/Users/apple1/OneDrive/Python Training/Python_Raw_files/u.user', sep='|', names=u_cols, encoding='latin-1', header= 0)

r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
df_ratings = pd.read_csv('/Users/apple1/OneDrive/Python Training/Python_Raw_files/u.data', sep='\t', names=r_cols, encoding='latin-1')

m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
df_movies = pd.read_csv('/Users/apple1/OneDrive/Python Training/Python_Raw_files/u.item', sep='|', names=m_cols, usecols=range(5), encoding='latin-1')# only load the first five columns

In [40]:
df_users.head()

   user_id  age sex  occupation zip_code
0        2   53   F       other    94043
1        3   23   M      writer    32067
2        4   24   M  technician    43537
3        5   33   F       other    15213
4        6   42   M   executive    98101

## Summary

1. [Inspect](#1.-Inspect)<br>
    a) .dtype<br>
    b) .describe()<br>
    c) .head(), .tail(), [i:j]
2. [Select](#2.-Select)<br>
    a) Column Selection<br>
    b) Row Selection<br>
3. [Sort](#3.-Sort)<br>
    a) .sort() for DataFrames<br>
    b) .order() for Series<br>
4. [Operations](#4.-Operations)<br>
    a) Descriptive Stats<br>
    b) Apply<br>
    b) Bins<br>
    b) Histograms<br>
5. [Split-Apply-Combine](#5.-Split-Apply-Combine)
6. [Other](#6.-Other)<br>
    a) Rename columns<br>
    b) Missing values<br>

## 1. Inspect

Pandas has a variety of functions for getting basic information about your DataFrame.<br>
The most basic of which is **calling your DataFrame by name**. The output tells a few things about our DataFrame.

1. It's an instance of a DataFrame.
2. Each row is assigned an index of 0 to N-1, where N is the number of rows in the DataFrame. (index can be set arbitrary)
3. There are 1,682 rows (every row must have an index).
4. Our dataset has five total columns, one of which isn't populated at all (video_release_date) and two that are missing some values (release_date and imdb_url).

In [41]:
df_movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

### a)  `.dtypes`
Use the `.dtypes` attribute to get the datatype for each column.

In [42]:
print (df_movies.dtypes,'\n')

print (df_users.dtypes,'\n')

print (df_ratings.dtypes,'\n')

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

user_id        int64
age            int64
sex           object
occupation    object
zip_code      object
dtype: object

user_id           int64
movie_id          int64
rating            int64
unix_timestamp    int64
dtype: object

In [43]:
df_users.head()

   user_id  age sex  occupation zip_code
0        2   53   F       other    94043
1        3   23   M      writer    32067
2        4   24   M  technician    43537
3        5   33   F       other    15213
4        6   42   M   executive    98101

In [44]:
df_ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [45]:
df_movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

### b) `.describe()`
Use the `.describe()` method to see the basic statistics about the DataFrame's **numeric columns**. Be careful though, since this will return information on **all** columns of a numeric datatype.

In [46]:
df_users.describe()

          user_id         age
count  942.000000  942.000000
mean   472.500000   34.062633
std    272.076276   12.194810
min      2.000000    7.000000
25%    237.250000   25.000000
50%    472.500000   31.000000
75%    707.750000   43.000000
max    943.000000   73.000000

Notice `user_id` was included since it's numeric. Since this is an ID value, the stats for it don't really matter.

We can quickly see the average age of our users is just above 34 years old, with the youngest being 7 and the oldest being 73. The median age is 31, with the youngest quartile of users being 25 or younger, and the oldest quartile being at least 43.

### c) `.head(), tail(), [i:j]`
By default, **`.head()`** displays the first five records of the DataFrame, while **`.tail()`** displays the last five.<br>
Alternatively, Python's regular slicing **`[i:j]`** syntax works as well.

In [47]:
print (df_users.head())

   user_id  age sex  occupation zip_code
0        2   53   F       other    94043
1        3   23   M      writer    32067
2        4   24   M  technician    43537
3        5   33   F       other    15213
4        6   42   M   executive    98101

In [48]:
print (df_users.tail())

     user_id  age sex     occupation zip_code
937      939   26   F        student    33319
938      940   32   M  administrator    02215
939      941   20   M        student    97229
940      942   48   F      librarian    78209
941      943   22   M        student    77841

In [49]:
print (df_users[740:741])

     user_id  age sex occupation zip_code
740      742   35   M    student    29210

## 2. Select

### a) Column Selection

You can think of a DataFrame as a group of Series (ie: rows) that share an index (ie: column headers). This makes it easy to select specific columns.

**Single column selection**<br>
Selecting a single column from the DataFrame will return a **Series object**.

In [50]:
df_users['user_id'].head()

0    2
1    3
2    4
3    5
4    6
Name: user_id, dtype: int64

In [51]:
df_users['occupation'].head()

0         other
1        writer
2    technician
3         other
4     executive
Name: occupation, dtype: object

**Multiple columns selection**<br>
To select multiple columns, simply pass a **list of column names** to the DataFrame, the output of which will be a **DataFrame**.

In [52]:
list_of_cols = ['occupation', 'sex'] 
print (df_users[list_of_cols].head())

   occupation sex
0       other   F
1      writer   M
2  technician   M
3       other   F
4   executive   M

In [53]:
list_of_cols

['occupation', 'sex']

### b) Row Selection
Row selection can be done [multiple ways](http://pandas.pydata.org/pandas-docs/stable/indexing.html), but using **boolean indexing** or **individual index `.ix()`** are typically easiest.

#### Boolean Indexing

In [54]:
df_movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [55]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   movie_id            1682 non-null   int64
 1   title               1682 non-null   object
 2   release_date        1681 non-null   object
 3   video_release_date  0 non-null      float64
 4   imdb_url            1679 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 65.8+ KB

In [56]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 942 entries, 0 to 941
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     942 non-null    int64
 1   age         942 non-null    int64
 2   sex         942 non-null    object
 3   occupation  942 non-null    object
 4   zip_code    942 non-null    object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

In [57]:
# users older than 25
print (df_users[df_users.age > 25].head(7), '\n')

   user_id  age sex     occupation zip_code
0        2   53   F          other    94043
3        5   33   F          other    15213
4        6   42   M      executive    98101
5        7   57   M  administrator    91344
6        8   36   M  administrator    05201
7        9   29   M        student    01002
8       10   53   M         lawyer    90703

In [58]:
# users aged 40 AND male
print (df_users[(df_users.age == 26) & (df_users.sex == 'M')].head(3), '\n')

# users younger than 30 OR female
print (df_users[(df_users.sex == 'F') | (df_users.age < 30)].head(10))

    user_id  age sex  occupation zip_code
19       21   26   M      writer    30068
42       44   26   M  technician    46260
51       53   26   M  programmer    55414

    user_id  age sex     occupation zip_code
0         2   53   F          other    94043
1         3   23   M         writer    32067
2         4   24   M     technician    43537
3         5   33   F          other    15213
7         9   29   M        student    01002
9        11   39   F          other    30329
10       12   28   F          other    06405
13       15   49   F       educator    97301
14       16   21   M  entertainment    10309
16       18   35   F          other    37212

In [59]:
# users younger than 30 
print (df_users[(df_users.age < 30)].head(3))

   user_id  age sex  occupation zip_code
1        3   23   M      writer    32067
2        4   24   M  technician    43537
7        9   29   M     student    01002

In [60]:
# users who are female
print (df_users[(df_users.sex == 'F')].head())

    user_id  age sex occupation zip_code
0         2   53   F      other    94043
3         5   33   F      other    15213
9        11   39   F      other    30329
10       12   28   F      other    06405
13       15   49   F   educator    97301

In [61]:
# users younger than 30 and female
print (df_users[(df_users.sex == 'F') & (df_users.age < 30)].head())

    user_id  age sex occupation zip_code
10       12   28   F      other    06405
22       24   21   F     artist    94533
30       32   28   F    student    78741
33       35   20   F  homemaker    42459
34       36   19   F    student    93117

In [62]:
# users younger than 30 OR female
print (df_users[(df_users.sex == 'F') | (df_users.age < 30)].head())

   user_id  age sex  occupation zip_code
0        2   53   F       other    94043
1        3   23   M      writer    32067
2        4   24   M  technician    43537
3        5   33   F       other    15213
7        9   29   M     student    01002

#### `.ix()` method

When you change the indexing of a DataFrame to a specific column, you use the default pandas 0-based index.<br>
Use **`.ix()`** method for row selection based on the new index.

Let's set the index to the `user_id` using the **`.set_index()`** method.<br>
NB: By default, `.set_index()` returns a new DataFrame, so you'll have to specify if you'd like the changes to occur in place.

In [63]:
# Change index column (new DataFrame)
new_df_users = df_users.set_index('user_id')
print (new_df_users.head())
print('/n')
# Change index column (inplace)
df_users.set_index('user_id', inplace=True)
print (df_users.head(3))

         age sex  occupation zip_code
user_id
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537
5         33   F       other    15213
6         42   M   executive    98101
/n
         age sex  occupation zip_code
user_id
2         53   F       other    94043
3         23   M      writer    32067
4         24   M  technician    43537

In [64]:
print (df_users.loc[99])

age                20
sex                 M
occupation    student
zip_code        63129
Name: 99, dtype: object

Use the **`.reset_index()`** method to reset the default index (the same rule apply for inplace).

In [68]:
df_users.reset_index(inplace=True)
print (df_users.head())

   user_id  age sex  occupation zip_code
0        2   53   F       other    94043
1        3   23   M      writer    32067
2        4   24   M  technician    43537
3        5   33   F       other    15213
4        6   42   M   executive    98101

In [69]:
print (df_users.loc[99])

user_id           101
age                15
sex                 M
occupation    student
zip_code        05146
Name: 99, dtype: object

## 3. Sort

### a) `.sort()` for DataFrames
Use **`.sort()`** method to sort DataFrames. Returns a new instance of a Dataframe. (See [DOC](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort.html))

>- `column` : column name to base the sorting on (list for nested sorting / tuple for multi-index sorting)
>- `ascending (True)` : sort ascending vs. descending (specify list for multiple sort orders)
>- `inplace (False)`: result is a new instance of DataFrame

In [70]:
df_users.sort_values('age', ascending=True, inplace=False).head()

     user_id  age sex occupation zip_code
28        30    7   M    student    55436
469      471   10   M    student    77459
287      289   11   M       none    94619
626      628   13   M       none    94306
878      880   13   M    student    83702

In [71]:
df_users.head()

   user_id  age sex  occupation zip_code
0        2   53   F       other    94043
1        3   23   M      writer    32067
2        4   24   M  technician    43537
3        5   33   F       other    15213
4        6   42   M   executive    98101

In [72]:
df_users.sort_values('age', ascending=False, inplace=True)

In [73]:
df_users.sort_values('age', ascending=False, inplace=True)

In [74]:
# Oldest techicians
df_users.sort_values('age', ascending=False, inplace=True)
print (df_users[df_users.occupation == "technician"][:5])

     user_id  age sex  occupation zip_code
195      197   55   M  technician    75094
439      441   50   M  technician    55013
323      325   48   M  technician    02139
486      488   48   M  technician    21012
456      458   47   M  technician    Y1A6B

## 4. Operations

### a) Descriptive Stats

A large number of methods for computing descriptive statistics and other related operations on Series, DataFrame, and Panel. For DataFrames these methods take an axis argument:
>- axis=0 : compute over indexes
>- axis=1 : compute over columns

Most methods produce a lower-dimensional result (aka aggregate functions) :
- `.count()`: number of NOT NULL values
- `.nunique()`: number of unique NOT NULL values
- `.size()` : number of values
- `.min()`:	minimum
- `.max()`:	maximum
- `.sum()`:	sum of values
- `.prod()`: product of values
- `.median()`: arithmetic median of values
- `.quantile()`: sample quantile (value at %)
- `.mean()`: mean of values
- `.std()`:	unbiased standard deviation
- `.var()`:	unbiased variance
- `.mad()`:	mean absolute deviation
- `.sem()`:	unbiased standard error of the mean
- `.skew()`: unbiased skewness (3rd moment)
- `.kurt()`: unbiased kurtosis (4th moment)

Some methods produce an object of the same size :
- `.rank()`: compute data rank (1 through n)
- `.mode()`: mode
- `.abs()`:	absolute value
- `.cumsum()`: cumulative sum
- `.cumprod()`: cumulative product
- `.cummax()`: cumulative maximum
- `.cummin()`: cumulative minimum

In [75]:
df_users.count()

user_id       942
age           942
sex           942
occupation    942
zip_code      942
dtype: int64

In [76]:
df_users.age.max()

73

In [77]:
df_users.age.mean()

34.06263269639066

In [78]:
df_users.age.median()

31.0

### b) Apply

To apply **your own or another librarys functions** to pandas objects, you should be aware of the three methods below. The appropriate method to use depends on whether your function expects to operate on an entire DataFrame or Series, row- or column-wise, or elementwise.

- Tablewise Function Application: **`.pipe()`**
- Row or Column-wise Function Application: **`.apply()`**
- Elementwise function application: **`.applymap()`** or **`.map()`**

#### `.pipe()`
Use `.pipe()` for method chaining **over a DataFrame**. (See [DOC](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.pipe.html))<br>
The following two are equivalent :
    - f(g(h(df), arg1=1), arg2=2, arg3=3)
    - df.pipe(h).pipe(g, arg1=1).pipe(f, arg2=2, arg3=3)
The pipe method is inspired by unix pipes and more recently dplyr and magrittr, which have introduced the popular (%>%) (read pipe) operator for R.

#### `.apply()`
Use `.apply()` to apply a function **along the axes** of a DataFrame, like the descriptive statistics methods. (See [DOC](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.apply.html))<br>

    - df.apply(np.mean, axis=1)
    - df.apply(lambda x: x.max() - x.min())

#### `.applymap()` / `.map()`
Use `.applymap()` on DataFrame or `.map()` on Series to **operate elementwise**.<br>
The vectorized function must take a single value and return a single value.(See [DOC](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.applymap.html))<br>

    - df.applymap(lambda x: len(str(x)))
    - df['colA'].map(lambda x: len(str(x)))

### c) Bins

Use **`pandas.cut()`** static method to bin numeric values into groups. Useful for discretization. ([DOC](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.cut.html))

`pandas.cut(x, bins)` returns an array of the indices (or labels) of the half-open bins to which each value of `x` belongs.

>- `x` : array of values to be binned
>- `bins` : sequence defining the bin edges
>- `right` (True): boolean indicating whether the bins include the rightmost edge or not ([a,b] or [a,b[)
>- `labels` (None): array used as labels for the resulting bins

In [79]:
df_users.head()

     user_id  age sex     occupation zip_code
479      481   73   M        retired    37771
801      803   70   M  administrator    78212
765      767   70   M       engineer    00000
858      860   70   F        retired    48322
557      559   69   M      executive    10022

In [80]:
bins = range(0, 81, 10)
list(bins)

[0, 10, 20, 30, 40, 50, 60, 70, 80]

In [81]:
xyz = ['A', '10-19', '20-29', '30-39', '40-49', '50-59', '60-69', 'Sr. Cit.']

In [82]:
df_users['age_group'] = pd.cut(df_users.age, bins, right=False, labels=xyz)
print (df_users[0:45]) # preview of age bin

     user_id  age sex     occupation zip_code age_group
479      481   73   M        retired    37771  Sr. Cit.
801      803   70   M  administrator    78212  Sr. Cit.
765      767   70   M       engineer    00000  Sr. Cit.
858      860   70   F        retired    48322  Sr. Cit.
557      559   69   M      executive    10022     60-69
583      585   69   M      librarian    98501     60-69
347      349   68   M        retired    61455     60-69
571      573   68   M        retired    48911     60-69
209      211   66   M       salesman    32605     60-69
562      564   65   M        retired    94591     60-69
649      651   65   M        retired    02903     60-69
316      318   65   M        retired    06518     60-69
421      423   64   M          other    91606     60-69
843      845   64   M         doctor    97405     60-69
362      364   63   M       engineer    01810     60-69
856      858   63   M       educator    09645     60-69
775      777   63   M     programmer    01810     60-69
518      520   62   M     healthcare    12603     60-69
264      266   62   F  administrator    78756     60-69
104      106   61   M        retired    55125     60-69
932      934   61   M       engineer    22902     60-69
349      351   61   M       educator    49938     60-69
462      464   60   M         writer    94583     60-69
467      469   60   M       educator    78628     60-69
929      931   60   M       educator    33556     60-69
692      694   60   M     programmer    06365     60-69
898      900   60   M        retired    18505     60-69
306      308   60   M        retired    95076     60-69
232      234   60   M        retired    94702     60-69
88        90   60   M       educator    78155     60-69
750      752   60   M        retired    21201     60-69
752      754   59   F      librarian    62901     50-59
817      819   59   M  administrator    40205     50-59
129      131   59   F  administrator    15237     50-59
551      553   58   M       educator    62901     50-59
726      728   58   M      executive    94306     50-59
930      932   58   M       educator    06437     50-59
452      454   57   M          other    97330     50-59
478      480   57   M        retired    98257     50-59
394      396   57   M       engineer    94551     50-59
109      111   57   M       engineer    90630     50-59
589      591   57   F      librarian    92093     50-59
155      157   57   M       engineer    70808     50-59
490      492   57   M       educator    94618     50-59
5          7   57   M  administrator    91344     50-59

### d) Histograms

Use **`.value_counts()`** Series method to return the **counts** of **unique values** (ie frequency). (See [DOC](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.value_counts.html#pandas.Series.value_counts))

In [83]:
df_users['occupation'].value_counts().head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

## 5. Split-Apply-Combine

Use **`.groupby()`** method to execute the [split-apply-combine strategy](http://www.jstatsoft.org/v40/i01/paper) for data analysis :
1. **Split** the DataFrame into groups based on some criteria (DataFrameGroupBy or SeriesGroupBy)
2. **Apply** a function to each group independently
3. **Combine** the results into a data structure (DataFrame or Series)

![split-apply-combine-methodology](http://nbviewer.ipython.org/github/umddb/datascience-fall14/blob/master/lab3/img/splitApplyCombine.png)

**DataFrameGroupBy/SeriesGroupBy Methods** (See [Doc](http://pandas.pydata.org/pandas-docs/stable/api.html#function-application))
- `.apply()`: apply your own or another library's function or list of functions 
- `.agg()`: aggregate using input function or dict of {column: function}
- `.transform()`: transform 
- `.filter()`: return a copy of a DataFrame excluding elements from groups

<br>
In the apply step, we might wish to do one of the following:
- **Aggregation**: computing a summary statistic (or statistics) about each group. Some examples:
    - Compute group columns sums and means : 
        - `gby.agg([np.sum, np.mean])`
    - Compute group sizes and counts : 
        - `gby.agg([np.size, np.mean])`
- **Transformation**: perform some group-specific computations on every data point. Some examples:
    - Standardizing data (zscore) within group : 
        - `gby.transform(lambda x: (x - x.mean()) / x.std())`
    - Filling NAs within groups with a value derived from each group
        - `gby.fillna(x.mean())`
- **Filtration**: discard some groups, according to a group-wise computation that evaluates True or False. Some examples:
    - Discarding data that belongs to groups with only a few members : 
        - `gby.filter(lambda x: x.size() > 100)`
    - Discarding data based on the group sum or mean
        - `gby.filter(lambda x: x['A'].sum() + x['B'].sum() > 0)`
    - Discarding data for missing data
        - `gby.dropna(axis=0)`

#### City of Chicago salaries
The City of Chicago is kind enough to publish all city employee salaries to its open data portal. Let's go through some basic `groupby` examples using this data.

In [84]:
!head -n 10 city-of-chicago-salaries.csv

head: city-of-chicago-salaries.csv: No such file or directory

Since the data contains a '$' sign for each salary, python will treat the field as a series of strings. We can use the converters parameter to change this when reading in the file.

> `converters` = Dict of functions for converting values in certain columns. Keys can either be integers or column labels

In [85]:
headers = ['name', 'title', 'department', 'salary']
headers

['name', 'title', 'department', 'salary']

In [87]:
df_chicago = pd.read_csv('/Users/apple1/OneDrive/Python Training/Python_Raw_files/city-of-chicago-salaries.csv',
                      header= 0,
                      names=headers,
                      converters={'salary': lambda x: float(x.replace('$', ''))})

In [88]:
print (df_chicago.head(10))

                     name                     title        department   salary
0         AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT  85512.0
1       AARON,  JEFFERY M            POLICE OFFICER            POLICE  75372.0
2     AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES  80916.0
3     ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  99648.0
4   ABBATACOLA,  ROBERT J       ELECTRICAL MECHANIC          AVIATION  89440.0
5   ABBATEMARCO,  JAMES J               FIREFIGHTER              FIRE  78012.0
6        ABBATE,  TERRY M            POLICE OFFICER            POLICE  80724.0
7        ABBOTT,  BETTY L        FOSTER GRANDPARENT  FAMILY & SUPPORT   2756.0
8       ABBOTT,  LYNISE M                 CLERK III            POLICE  41784.0
9  ABBRUZZESE,  WILLIAM J    INVESTIGATOR - IPRA II              IPRA  62832.0

In [89]:
print (df_chicago.groupby('department').count().head()), '\n' # NOT NULL records within each column
print (df_chicago.groupby('department').size().head()) # total records for each department

                   name  title  salary
department
ADMIN HEARNG         42     42      42
ANIMAL CONTRL        61     61      61
AVIATION           1218   1218    1218
BOARD OF ELECTION   110    110     110
BOARD OF ETHICS       9      9       9
department
ADMIN HEARNG           42
ANIMAL CONTRL          61
AVIATION             1218
BOARD OF ELECTION     110
BOARD OF ETHICS         9
dtype: int64

In [90]:
print (df_chicago.groupby('department').agg({'salary': [np.size, np.mean]}).head())

                   salary
                     size          mean
department
ADMIN HEARNG         42.0  70336.857143
ANIMAL CONTRL        61.0  57121.455738
AVIATION           1218.0  70638.249130
BOARD OF ELECTION   110.0  55728.872727
BOARD OF ETHICS       9.0  81650.666667

### What departments have the most number of distinct title positions ?

1. Split DataFrame into groups by departement, keep only title column => **SeriesGroupBy**
2. Apply `.nunique()` method
3. (Combine into **Serie**)
4. Order resulting **Serie** (NB: `.order()` is for Series, `.sort()` is for DataFrames)

In [91]:
print (df_chicago.groupby('department').title.nunique().sort_values(ascending=True)[:30])

department
LICENSE APPL COMM          1
POLICE BOARD               2
BOARD OF ETHICS            9
HUMAN RELATIONS           12
ADMIN HEARNG              15
TREASURER                 16
ANIMAL CONTRL             19
IPRA                      22
DISABILITIES              22
INSPECTOR GEN             23
BOARD OF ELECTION         23
BUDGET & MGMT             24
MAYOR'S OFFICE            28
CITY COUNCIL              28
PROCUREMENT               30
HUMAN RESOURCES           32
CITY CLERK                39
CULTURAL AFFAIRS          39
DoIT                      40
BUILDINGS                 49
LAW                       50
BUSINESS AFFAIRS          64
OEMC                      69
COMMUNITY DEVELOPMENT     71
STREETS & SAN             71
PUBLIC LIBRARY            72
FIRE                      91
FINANCE                   98
FAMILY & SUPPORT         113
GENERAL SERVICES         117
Name: title, dtype: int64

### What department pays best on average ?

1. Split DataFrame into groups by departement => **DataFrameGroupBy**
2. Apply `.mean()` method
3. (Combine into **DataFrame**)
4. Sort resulting **DataFrame** according to the salary (NB: `.order()` is for Series, `.sort()` is for DataFrames)

In [92]:
print (df_chicago.groupby('department').mean().sort_values('salary', ascending=False).head())

                      salary
department
DoIT            93209.939394
BUILDINGS       90720.081322
FIRE            89579.082621
MAYOR'S OFFICE  85251.949091
BUDGET & MGMT   84767.181818

In [93]:
print (df_chicago.groupby('department').agg({'salary': [np.size, np.mean]}).sort_values(('salary', 'mean'), ascending=False).head())

                salary
                  size          mean
department
DoIT              99.0  93209.939394
BUILDINGS        242.0  90720.081322
FIRE            4731.0  89579.082621
MAYOR'S OFFICE    99.0  85251.949091
BUDGET & MGMT     44.0  84767.181818

### Who is the highest paid employee of each department ?

1. Split DataFrame into groups by departement, keep only salary column => **SeriesGroupBy**
2. Apply `.rank()` method
3. (Combine into **Serie**)
4. Assign the resulting Serie to a new column of the DataFrame
5. Sort DataFrame according to salary (NB: `.order()` is for Series, `.sort()` is for DataFrames)
6. Display only first rankers

For the `.rank()` method, use attributes: 
- `ascending=False` : to rank high (1) to low (N)
- `method='first'` : so that equally high paid people within a department don't get the same rank .

In [94]:
df_chicago['dept_rank'] = df_chicago.groupby('department')['salary'].rank(method='first', ascending=False)
df_chicago.sort_values('salary', ascending=False, inplace=True)
print (df_chicago[df_chicago['dept_rank'] == 1].head())

                         name                     title      department  \
18039     MC CARTHY,  GARRY F  SUPERINTENDENT OF POLICE          POLICE
8004           EMANUEL,  RAHM                     MAYOR  MAYOR'S OFFICE
25588       SANTIAGO,  JOSE A         FIRE COMMISSIONER            FIRE
763    ANDOLINO,  ROSEMARIE S  COMMISSIONER OF AVIATION        AVIATION
4697     CHOUCAIR,  BECHARA N    COMMISSIONER OF HEALTH          HEALTH

         salary  dept_rank
18039  260004.0        1.0
8004   216210.0        1.0
25588  202728.0        1.0
763    186576.0        1.0
4697   177156.0        1.0

In [95]:
print (df_chicago[df_chicago['department'] == 'MAYOR\'S OFFICE'].tail(10))

                          name                             title  \
7498         DUBIN,  LINDSAY P  STUDENT INTERN - MAYOR'S FELLOWS
8062         EPSTEIN,  PAIGE A  STUDENT INTERN - MAYOR'S FELLOWS
19324         MODLIN,  EMILY L  STUDENT INTERN - MAYOR'S FELLOWS
24861     ROSENBERG,  AMANDA J   STUDENT INTERN - MAYOR'S OFFICE
15278           KOSS,  KELLY K  STUDENT INTERN - MAYOR'S FELLOWS
31312  WITHERSPOON,  KATELYN K  STUDENT INTERN - MAYOR'S FELLOWS
4589             CHEN,  YIXIAN  STUDENT INTERN - MAYOR'S FELLOWS
29745        VILLA,  FABIOLA V  STUDENT INTERN - MAYOR'S FELLOWS
16182           LE,  THU GIANG  STUDENT INTERN - MAYOR'S FELLOWS
15146            KOCH,  STEVEN          ADMINISTRATIVE SECRETARY

           department    salary  dept_rank
7498   MAYOR'S OFFICE  36400.00       91.0
8062   MAYOR'S OFFICE  36400.00       92.0
19324  MAYOR'S OFFICE  36400.00       95.0
24861  MAYOR'S OFFICE  36400.00       96.0
15278  MAYOR'S OFFICE  36400.00       93.0
31312  MAYOR'S OFFICE  36400.00       98.0
4589   MAYOR'S OFFICE  36400.00       90.0
29745  MAYOR'S OFFICE  36400.00       97.0
16182  MAYOR'S OFFICE  36400.00       94.0
15146  MAYOR'S OFFICE      0.96       99.0

## 6. Other

### a) Rename columns

Use `.rename()` method to change columns names.

ex: df.rename(columns={'old_col_name' : 'new_col_name'}, inplace = True)

>- columns : dictionnary containing the transformations to apply
>- inplace (False) : result is a new instance of DataFrame

In [96]:
import urllib.request
from urllib.request import urlopen
from io import StringIO

# store the text from the URL response in our url variable
url = urlopen('https://raw.github.com/gjreda/best-sandwiches/master/data/best-sandwiches-geocode.tsv').read().decode('utf-8')
url

'rank\tsandwich\trestaurant\tdescription\tprice\taddress\tcity\tphone\twebsite\tfull_address\tformatted_address\tlat\tlng\r\n1\tBLT\tOld Oak Tap\tThe B is applewood smoked&mdash;nice and snappy. The L is arugula&mdash;fresh and peppery. The T is a fried green slice&mdash;jacketed in cornmeal and greaseless. Slathered with pimiento cheese, the grilled ciabatta somehow stays crisp, providing three distinct layers of crunch. Truly inspired.\t$10\t2109 W. Chicago Ave.\tChicago\t773-772-0406\ttheoldoaktap.com\t2109 W. Chicago Ave., Chicago\t2109 West Chicago Avenue, Chicago, IL 60622, USA\t41.8957344\t-87.6799598\r\n2\tFried Bologna\tAu Cheval\tThought your bologna-eating days had retired with your lunchbox? Luscious house-cured mortadella dotted with black pepper, sliced thin, and piled into layers on a spongy brioche bun should put you right back in the game. No thermos necessary.\t$9\t800 W. Randolph St.\tChicago\t312-929-4580\taucheval.tumblr.com\t800 W. Randolph St., Chicago\t800 West Randolph Street, Chicago, IL 60607, USA\t41.8846721\t-87.647754\r\n3\tWoodland Mushroom\tXoco\tLeave it to Rick Bayless and crew to come up with a vegetarian sandwich&mdash;garlicky roasted mushrooms commingling with tangy goat cheese and sharp arugula&mdash;as satisfying as the rest of the meat-packed menu. The three-chili salsa is a must-drizzle.\t$9.50.\t445 N. Clark St.\tChicago\t312-334-3688\trickbayless.com\t445 N. Clark St., Chicago\t445 North Clark Street, Chicago, IL 60654, USA\t41.8906019\t-87.6309254\r\n4\tRoast Beef\tAl&rsquo;s Deli\tThe Francophile brothers behind this deli, which has been in the family for 63 years, have turned simple ingredients into a sophisticated sandwich that balances savory and sweet: just rare roast beef, fresh tomato, Swiss cheese, and homemade b&eacute;arnaise sauce on a buttery croissant.\t$9.40.\t914 Noyes St.\tEvanston\t\talsdeli.net\t914 Noyes St., Evanston\t914 Noyes Street, Evanston, IL 60201, USA\t42.0584418\t-87.6844254\r\n5\tPB&amp;L\tPublican Qualty Meats\tWhen this place opened in February, it quickly rose to the top tier with its refined roster of sandwiches. Take, for instance, the one with grilled housemade pork belly and lamb sausage. It&rsquo;s sprinkled with feta, cilantro, and sweet and spicy pip&eacute;rade and tucked into a toasted, buttered lobster roll. It&rsquo;s like the quarterback on a team packed with future Hall-of-Famers.\t$10\t825 W. Fulton Mkt.\tChicago\t312-445-8977\tpublicanqualitymeats.com\t825 W. Fulton Mkt., Chicago\t825 West Fulton Market, Chicago, IL 60607, USA\t41.8866372\t-87.6485525\r\n6\tBelgian Chicken Curry Salad\tHendrickx Belgian Bread Crafter\tThe mom-and-pop aesthetic is a yeast-scented breath of fresh air in glitzy Streeterville, and the bakery turns out one gorgeous chicken salad. Chewy Belgian country bread encapsulates pulled chicken breast sauced with a delicate housemade curry.\t$7.25.\t100 E. Walton St.\tChicago\t312-649-6717\t\t100 E. Walton St., Chicago\t100 East Walton Street, Chicago, IL 60611, USA\t41.900246\t-87.625163\r\n7\tLobster Roll\tAcadia\tIn a town that recently discovered the joys of lobster rolls, nobody does them better than Ryan McCaskey. He flies in fresh crustaceans from Maine daily, poaches them, sprinkles them with paprika and chives, and cradles them in buttery grilled rolls. From the Atlantic to your belly in 24 hours.\t$16\t1639 S. Wabash Ave.\tChicago\t312-360-9500\tacadiachicago.com\t1639 S. Wabash Ave., Chicago\t1639 South Wabash Avenue, Chicago, IL 60616, USA\t41.858965\t-87.625142\r\n8\tSmoked Salmon Salad\tBirchwood Kitchen\tBirchwood&rsquo;s sandwich-slinging virtuosos consistently wow us with their seasonal menus. This time around, they&rsquo;ve put a fallish slant on salmon salad, adding subtle notes of squash, red onion, sage, and chopped arugula to the mix and smooshing it inside a buttery, toasted sesame bagel.\t$10\t2211 W. North Ave.\tChicago\t773-276-2100\tbirchwoodkitchen.com\t2211 W. North Ave., Chicago\t2211 West North Avenue, Chicago, IL 60647, USA\t41.9103244\t-87.6828424\r\n9\tAtomica Cemitas\tCemitas Puebla\tStanding three inches high, the Atomica is something to behold. It&rsquo;s also a finely tuned blend of textures and spices: Krakus ham, guajillo pork loin, breaded milanesa, avocado, and Oaxacan cheese. For an extra kick, sprinkle salsa over the multitiered meat fiesta.\t$9\t3619 W. North Ave.\tChicago\t773-772-8435\tcemitaspuebla.com\t3619 W. North Ave., Chicago\t3619 West North Avenue, Chicago, IL 60647, USA\t41.9098499\t-87.7175808\r\n10\tGrilled Laughing Bird Shrimp and Fried Oyster Po&rsquo; Boy\tNana\tGrilled Laughing Bird shrimp and fried oyster po&rsquo; boy, Nana<br />   Will it be shrimp? Or, gee, the oysters? In Cajun country, you are forced to choose. So bless Bridgeport, where the friendly organic joint Nana packs a meal-and-a-half-size baguette with both&mdash;grilled Laughing Bird shrimp, perfectly fried oysters&mdash;and, for good Midwestern measure, adds housemade giardiniera.\t$17\t3267 S. Halsted St.\tChicago\t312-929-2486\tnanaorganic.com\t3267 S. Halsted St., Chicago\t3267 South Halsted Street, Chicago, IL 60608, USA\t41.8345589\t-87.6460491\r\n11\tHam and Raclette Panino\tLula Cafe\tA crusty ciabatta bun is a flavorsome sponge for oozing Swiss cheese, rich egg yolk, and mustard with sweet-and-sour bursts of black currant. Smoky cured ham seals the deal.\t$11\t2537 N. Kedzie Blvd.\tChicago\t773-489-9554\tlulacafe.com\t2537 N. Kedzie Blvd., Chicago\t2537 North Kedzie Boulevard, Chicago, IL 60647, USA\t41.9270848\t-87.7072641\r\n12\tBreaded Steak\tRicobene&rsquo;s\tThis is what put Ricobene&rsquo;s on the map: breaded skirt steak topped with housemade meat sauce on a crusty Turano French roll and finished with your choice of cheese and peppers. It&rsquo;s juicy and sloppy, and you will finish every last bite.\t$5.49.\t252 W. 26th Street\tChicago\t(312) 225-5555\tricobenespizza.com\t252 W. 26th Street, Chicago\t252 West 26th Street, Chicago, IL 60616, USA\t41.845754\t-87.633895\r\n12\tBreaded Steak\tRicobene&rsquo;s\tThis is what put Ricobene&rsquo;s on the map: breaded skirt steak topped with housemade meat sauce on a crusty Turano French roll and finished with your choice of cheese and peppers. It&rsquo;s juicy and sloppy, and you will finish every last bite.\t$5.49.\t271 N. Weber Road\tBolingbrook\t(630) 378-4466\tricobenespizza.com\t271 N. Weber Road, Bolingbrook\t271 Weber Road, Bolingbrook, IL 60490, USA\t41.7032627\t-88.1256531\r\n12\tBreaded Steak\tRicobene&rsquo;s\tThis is what put Ricobene&rsquo;s on the map: breaded skirt steak topped with housemade meat sauce on a crusty Turano French roll and finished with your choice of cheese and peppers. It&rsquo;s juicy and sloppy, and you will finish every last bite.\t$5.49.\t5160 S. Pulaski Road\tChicago\t(773) 284-2400\tricobenespizza.com\t5160 S. Pulaski Road, Chicago\t5160 South Pulaski Road, Chicago, IL 60632, USA\t41.7989562\t-87.7234342\r\n12\tBreaded Steak\tRicobene&rsquo;s\tThis is what put Ricobene&rsquo;s on the map: breaded skirt steak topped with housemade meat sauce on a crusty Turano French roll and finished with your choice of cheese and peppers. It&rsquo;s juicy and sloppy, and you will finish every last bite.\t$5.49.\t9135 W. 159th Street\tOrland Hills\t(708) 460-9966\tricobenespizza.com\t9135 W. 159th Street, Orland Hills\t9135 West 159th Street, Orland Hills, IL 60487, USA\t41.6015413\t-87.8414067\r\n13\tThe Hawkeye\tFrog n Snail\tWe didn&rsquo;t expect a <em>Man v. Food&ndash;</em>esque behemoth on Dale Levitski&rsquo;s menu, but there it was: a shiny egg bun dripping grease from its delectable pan-fried and ground pork innards. And ten minutes later, there it wasn&rsquo;t.\t$14\t3124 N. Broadway\tChicago\t773-661-9166\tfrognsnail.com\t3124 N. Broadway, Chicago\t3124 North Broadway, Chicago, IL 60657, USA\t41.9385126\t-87.6444655\r\n14\tChicken Dip\tCrosby&rsquo;s Kitchen\tLuscious nuggets of white meat from the kitchen&rsquo;s rotisserie stand in for the French dip&rsquo;s usual fatty beef. Swathed in melted Jack cheese and heaped with tomato, onion, and arugula, they fold it into a soft-crisp baguette with authority. The jus is just windowdressing.\t$10\t3455 N. Southport Ave.\tChicago\t773-883-2525\tcrosbyskitchenchicago.com\t3455 N. Southport Ave., Chicago\t3455 North Southport Avenue, Chicago, IL 60657, USA\t41.9450868\t-87.6638068\r\n15\tWild Boar Sloppy Joe\tLongman &amp; Eagle\tWith its toasted brioche, peppery pickled jalape&ntilde;os, crispy onions, and fried sage, this Joe is a man-size wowzer spilling over with tender, spicy ground boar. It&rsquo;s better to cheat and use silverware than let any meaty morsels get away.\t$13\t2657 N. Kedzie Ave.\tChicago\t773-276-7110\tlongmanandeagle.com\t2657 N. Kedzie Ave., Chicago\t2657 North Kedzie Avenue, Chicago, IL 60647, USA\t41.9301009\t-87.7072427\r\n16\tMeatball Sub\tBari\tNo condiments, no fuss, just saucy meatballs (from the owners&rsquo; 80-year-old family recipe) on a crunchy Upper Crust roll, provolone optional. Sure, this Italian-heavy stretch of Grand Avenue is paved with meatballs&mdash;but at lunch the line starts and ends here.\t$4.50.\t1120 W. Grand Ave.\tChicago\t312-666-0730\tbariitaliansubs.com\t1120 W. Grand Ave., Chicago\t1120 West Grand Avenue, Chicago, IL 60642, USA\t41.8912131\t-87.6555343\r\n17\tCorned Beef\tManny&rsquo;s\tThe most famous deli sandwich in Chicago is also the gold standard: a sliced-to-order spectacle of salty-sweet meat that&rsquo;s so tender, juicy, and lean you&rsquo;ll savor it, sans the mild rye or the mustard, using only your fork.\t$11.95.\t1141 S. Jefferson St.\tChicago\t312-939-2855\tmannysdeli.com\t1141 S. Jefferson St., Chicago\t1141 South Jefferson Street, Chicago, IL 60607, USA\t41.8677925\t-87.6420625\r\n18\tTurkey Club\tEggy&rsquo;s\tCut in quarters and stabbed with cellophaned toothpicks, this turkey club on whole-wheat toast gets everything right, especially the thick slices of juicy turkey. Love the red onion, and the smear of housemade cilantro mayo is brilliant.\t$11.50.\t333 E. Benton Pl.\tChicago\t773-234-3449\teggysdiner.com\t333 E. Benton Pl., Chicago\t333 East Benton Place, Chicago, IL 60601, USA\t41.8854054\t-87.6176413\r\n19\tFalafel\tOld Jerusalem\tThe fritters of mashed chickpeas are perfectly cooked and seasonedno burnt balls here. Fresh tomatoes and lettuce and creamy tahini sauce only add to the tastiness.\t$6.25.\t1411 N. Wells St.\tChicago\t312-944-0459\toldjerusalemchicago.com\t1411 N. Wells St., Chicago\t1411 North Wells Street, Chicago, IL 60610, USA\t41.908\t-87.634157\r\n20\tCrab Cake\tMindy&rsquo;s HotChocolate\tIn these parts, crab cakes are always a gamble. Mindy Segal&rsquo;s sandwich hits the jackpot with its perfectly round patty that boasts a high crab-to-filler ratio, a spread of zesty giardiniera tartar sauce, and a housemade brioche bun gleaming with butter.\t$15\t1747 N. Damen Ave.\tChicago\t773-489-1747\thotchocolatechicago.com\t1747 N. Damen Ave., Chicago\t1747 North Damen Avenue, Chicago, IL 60647, USA\t41.913699\t-87.6774495\r\n21\tChicken Schnitzel\tOlga&rsquo;s Delicatessen\tA no-frills thrill, the schnitzel is a classic sandwich (white bread, tomato, lettuce, cheese, mayo, onion) made special by Olga&rsquo;s Old World touch, which creates an experience as familiar and personal as dinner at Grandma&rsquo;s.\t$5\t3209 W. Irving Park Rd.\tChicago\t773-539-8038\t\t3209 W. Irving Park Rd., Chicago\t3209 West Irving Park Road, Chicago, IL 60618, USA\t41.9538058\t-87.708466\r\n22\tShawarma\tDawali Mediterranean Kitchen\tDawali&rsquo;s filling shawarma escapes a common problem&mdash;the seasoned lamb-beef combo is in just the right proportion to the tahini sauce, greens, cucumbers, and pita bread.\t$6\t1625 N Halsted St.\tChicago\t(312) 944-5800\tdawalikitchen.com\t1625 N Halsted St., Chicago\t1625 North Halsted Street, Chicago, IL 60614, USA\t41.911714\t-87.6482182\r\n22\tShawarma\tDawali Mediterranean Kitchen\tDawali&rsquo;s filling shawarma escapes a common problem&mdash;the seasoned lamb-beef combo is in just the right proportion to the tahini sauce, greens, cucumbers, and pita bread.\t$6\t4911 N Kedzie Ave\tChicago\t(773) 267-4222\tdawalikitchen.com\t4911 N Kedzie Ave, Chicago\t4911 North Kedzie Avenue, Chicago, IL 60625, USA\t41.9707823\t-87.7085034\r\n23\tToasted Pimiento Cheese\tBig Jones\tNot the gooiest but definitely the kickiest grilled cheese around, thanks to the genius who thought to melt local heirloom pimientos right into the tangy cheddar. Chow-chow made with saut&eacute;ed onions, cabbage, and peppers adds to the glow it leaves in your mouth. You&rsquo;ll fall for the toasted marbled rye, too.\t$8\t5347 N. Clark St.\tChicago\t773-275-5725\tbigjoneschicago.com\t5347 N. Clark St., Chicago\t5347 North Clark Street, Chicago, IL 60640, USA\t41.9794572\t-87.6681775\r\n24\tVegetarian Panino\tLa Pane\tLa Pane might be known for pizza, but it offers a veggie panino with a punch. The power is in the piquant green pesto, made from peppers imported from Serbia, which is also delish on a freshly baked croissant.\t$5.99.\t2954 W. Irving Park Rd.\tChicago\t773-539-5321\tlapanechicago.com\t2954 W. Irving Park Rd., Chicago\t2954 West Irving Park Road, Chicago, IL 60618, USA\t41.9540244\t-87.7025206\r\n25\tCali Ch&egrave;vre\tPastoral\tSometimes you come across a sandwich with a combination of fillings so wacky it works. For example, why would anyone put avocado, goat cheese, spiced almond butter, celery, and red onions on a baguette? We love it&mdash;whatever the reason.\t$7.52.\t2945 N. Broadway\tChicago\t(773) 472-4781\tpastoralartisan.com\t2945 N. Broadway, Chicago\t2945 North Broadway, Chicago, IL 60657, USA\t41.9359824\t-87.6442561\r\n25\tCali Ch&egrave;vre\tPastoral\tSometimes you come across a sandwich with a combination of fillings so wacky it works. For example, why would anyone put avocado, goat cheese, spiced almond butter, celery, and red onions on a baguette? We love it&mdash;whatever the reason.\t$7.52.\t53 E. Lake\tChicago\t(312) 658-1250\tpastoralartisan.com\t53 E. Lake, Chicago\t53 East Lake Street, Chicago, IL 60601, USA\t41.8856078\t-87.6259252\r\n25\tCali Ch&egrave;vre\tPastoral\tSometimes you come across a sandwich with a combination of fillings so wacky it works. For example, why would anyone put avocado, goat cheese, spiced almond butter, celery, and red onions on a baguette? We love it&mdash;whatever the reason.\t$7.52.\t131 N. Clinton St\tChicago\t(312) 454-2200\tpastoralartisan.com\t131 N. Clinton St, Chicago\t131 North Clinton Street, Chicago, IL 60661, USA\t41.884106\t-87.641231\r\n26\tPastrami\tMax&rsquo;s Deli\tPastrami is the bacon of deli meats&mdash;a succulent, salty guilty pleasure that&rsquo;s rarely described as lean. Max&rsquo;s must have a surgeon working in the kitchen because we&rsquo;ve never seen pastrami this svelte and tender. And the juice from the warm meat soaks into the chewy rye bread.\t$11.95.\t191 Skokie Valley Rd.\tHighland Park\t\tmaxs-deli.com\t191 Skokie Valley Rd., Highland Park\t191 Skokie Valley Road, Highland Park, IL 60035, USA\t42.1558155\t-87.8042198\r\n27\tThe Fredo\tLucky&rsquo;s Sandwich Co.\tThis hulk&mdash;which stacks copious amounts of coleslaw and salty skin-on fries over layers of Italian deli meats and cold provolone on white&mdash;admits very few to the Clean Plate Club.\t$7.50.\t717 Maxwell Street.\tChicago\t(312) 733-5700\tluckysandwich.com\t717 Maxwell Street., Chicago\t717 West Maxwell Street, University of Illinois, University of Illinois at Chicago (UIC) Richard J. Daley Library, Chicago, IL 60607, USA\t41.8647002\t-87.6459216\r\n27\tThe Fredo\tLucky&rsquo;s Sandwich Co.\tThis hulk&mdash;which stacks copious amounts of coleslaw and salty skin-on fries over layers of Italian deli meats and cold provolone on white&mdash;admits very few to the Clean Plate Club.\t$7.50.\t3472 North Clark St.\tChicago\t(773) 549-0665\tluckysandwich.com\t3472 North Clark St., Chicago\t3472 North Clark Street, Chicago, IL 60657, USA\t41.945241\t-87.655353\r\n28\tSmoked Ham\tCity Provisions\tEach element of this highfalutin deli delight&mdash;smoky ham, pungent Gruy&egrave;re, mayo studded with chunks of apple and onion, a robust oatmeal rosemary baguette&mdash;is special enough to squelch your remorse about dropping the big bucks on it.\t$12.95.\t1818 W. Wilson Ave.\tChicago\t773-293-2489\tcityprovisions.com\t1818 W. Wilson Ave., Chicago\t1818 West Wilson Avenue, Chicago, IL 60640, USA\t41.9651612\t-87.6752161\r\n29\tJibarito\tPapa&rsquo;s Cache Sabroso\tTwo razor-thin fried plantains&mdash;crispy, not starchy&mdash;hold in place the sweet grilled onions, well-seasoned strips of beef, and a white cheese mild enough not to overwhelm a lilt of garlic. It&rsquo;s a true original: a cheesesteak-inspired jibarito.\t$7\t2517 W. Division St.\tChicago\t773-862-8313\tpapascachesabroso.com\t2517 W. Division St., Chicago\t2517 West Division Street, Chicago, IL 60622, USA\t41.9028871\t-87.6902641\r\n30\tShaved Prime Rib\tBavette&rsquo;s Bar &amp; Boeuf\tAny respectable diner offers this humblest of sandwiches, the French dip. At his interpretation of a French steak house, Brendan Sodikoff flips the paradigm by serving one with succulent prime rib and a gravy boat full of jus. It&rsquo;s like a French dip in the witness protection program.\t$21\t218 W. Kinzie St.\tChicago\t312-624-8154\t\t218 W. Kinzie St., Chicago\t218 West Kinzie Street, Chicago, IL 60654, USA\t41.8894019\t-87.634925\r\n31\tSerrano ham and Manchego cheese\tHannah&rsquo;s Bretzel\tA perpetually jammed workday lunch stop has no right turning out such beautifully marbled sliced-to-order ham. Nor should it top said ham with such thick and tasty fig chutney and encase it in an ultrafresh pretzel baguette.\t$9.79.\t400 N. LaSalle St.\tChicago\t\thannahsbretzel.com\t400 N. LaSalle St., Chicago\t400 North LaSalle Street, Chicago, IL 60654, USA\t41.8896595\t-87.633211\r\n31\tSerrano ham and Manchego cheese\tHannah&rsquo;s Bretzel\tA perpetually jammed workday lunch stop has no right turning out such beautifully marbled sliced-to-order ham. Nor should it top said ham with such thick and tasty fig chutney and encase it in an ultrafresh pretzel baguette.\t$9.79.\t131 S. Dearborn St.\tChicago\t\thannahsbretzel.com\t131 S. Dearborn St., Chicago\t131 South Dearborn Street, Chicago, IL 60603, USA\t41.879804\t-87.628283\r\n31\tSerrano ham and Manchego cheese\tHannah&rsquo;s Bretzel\tA perpetually jammed workday lunch stop has no right turning out such beautifully marbled sliced-to-order ham. Nor should it top said ham with such thick and tasty fig chutney and encase it in an ultrafresh pretzel baguette.\t$9.79.\t180 W. Washington St.\tChicago\t\thannahsbretzel.com\t180 W. Washington St., Chicago\t180 West Washington Street, Chicago, IL 60602, USA\t41.883445\t-87.633509\r\n31\tSerrano ham and Manchego cheese\tHannah&rsquo;s Bretzel\tA perpetually jammed workday lunch stop has no right turning out such beautifully marbled sliced-to-order ham. Nor should it top said ham with such thick and tasty fig chutney and encase it in an ultrafresh pretzel baguette.\t$9.79.\t233 N. Michigan Ave.\tChicago\t\thannahsbretzel.com\t233 N. Michigan Ave., Chicago\t233 North Michigan Avenue, Chicago, IL 60601, USA\t41.8868791\t-87.6238168\r\n32\tTuna Salad\tLa Fournette\tPierre Zimmermann claims to be a fourth-generation French baker. One bite of his housemade multigrain baguette laced with flax, sunflower, sesame, and pumpkin seeds convinced us. Glad he&rsquo;s not too proud to stuff it with a light and creamy tuna salad with sprouts and capers.\t$9.75.\t1547 N. Wells St.\tChicago\t312-624-9430\tlafournette.com\t1547 N. Wells St., Chicago\t1547 North Wells Street, Chicago, IL 60610, USA\t41.9105284\t-87.6346775\r\n33\tParamount Reuben\tParamount Room\tBriny lean brisket, kraut, and melted Gruy&egrave;re neatly packaged between two thick slices of toasted marble rye can be a mighty att

In [97]:
# treat the tab-separated text as a file with StringIO and read it into a DataFrame
from_url = pd.read_table(StringIO(url), sep = '\t')
from_url.head(10)

,rank,sandwich,restaurant,description,price,address,city,phone,website,full_address,formatted_address,lat,lng
0,1,BLT,Old Oak Tap,The B is applewood smoked&mdash;nice and snapp...,$10,2109 W. Chicago Ave.,Chicago,773-772-0406,theoldoaktap.com,"2109 W. Chicago Ave., Chicago","2109 West Chicago Avenue, Chicago, IL 60622, USA",41.895734,-87.679960
1,2,Fried Bologna,Au Cheval,Thought your bologna-eating days had retired w...,$9,800 W. Randolph St.,Chicago,312-929-4580,aucheval.tumblr.com,"800 W. Randolph St., Chicago","800 West Randolph Street, Chicago, IL 60607, USA",41.884672,-87.647754
2,3,Woodland Mushroom,Xoco,Leave it to Rick Bayless and crew to come up w...,$9.50.,445 N. Clark St.,Chicago,312-334-3688,rickbayless.com,"445 N. Clark St., Chicago","445 North Clark Street, Chicago, IL 60654, USA",41.890602,-87.630925
3,4,Roast Beef,Al&rsquo;s Deli,"The Francophile brothers behind this deli, whi...",$9.40.,914 Noyes St.,Evanston,NaN,alsdeli.net,"914 Noyes St., Evanston","914 Noyes Street, Evanston, IL 60201, USA",42.058442,-87.684425
4,5,PB&amp;L,Publican Qualty Meats,"When this place opened in February, it quickly...",$10,825 W. Fulton Mkt.,Chicago,312-445-8977,publicanqualitymeats.com,"825 W. Fulton Mkt., Chicago","825 West Fulton Market, Chicago, IL 60607, USA",41.886637,-87.648553
5,6,Belgian Chicken Curry Salad,Hendrickx Belgian Bread Crafter,The mom-and-pop aesthetic is a yeast-scented b...,$7.25.,100 E. Walton St.,Chicago,312-649-6717,NaN,"100 E. Walton St., Chicago","100 East Walton Street, Chicago, IL 60611, USA",41.900246,-87.625163
6,7,Lobster Roll,Acadia,In a town that recently discovered the joys of...,$16,1639 S. Wabash Ave.,Chicago,312-360-9500,acadiachicago.com,"1639 S. Wabash Ave., Chicago","1639 South Wabash Avenue, Chicago, IL 60616, USA",41.858965,-87.625142
7,8,Smoked Salmon Salad,Birchwood Kitchen,Birchwood&rsquo;s sandwich-slinging virtuosos ...,$10,2211 W. North Ave.,Chicago,773-276-2100,birchwoodkitchen.com,"2211 W. North Ave., Chicago","2211 West North Avenue, Chicago, IL 60647, USA",41.910324,-87.682842
8,9,Atomica Cemitas,Cemitas Puebla,"Standing three inches high, the Atomica is som...",$9,3619 W. North Ave.,Chicago,773-772-8435,cemitaspuebla.com,"3619 W. North Ave., Chicago","3619 West North Avenue, Chicago, IL 60647, USA",41.909850,-87.717581
9,10,Grilled Laughing Bird Shrimp and Fried Oyster ...,Nana,Grilled Laughing Bird shrimp and fried oyster ...,$17,3267 S. Halsted St.,Chicago,312-929-2486,nanaorganic.com,"3267 S. Halsted St., Chicago","3267 South Halsted Street, Chicago, IL 60608, USA",41.834559,-87.646049

## 3. Merge

Use the **`pandas.merge()`** static method to merge/join datasets in a [relational])<br>
Like SQL's JOIN clause, `pandas.merge()` allows two DataFrames to be joined on one or more keys.

- parameter **`how`** : specify which keys are to be included in the resulting table
- parameters **`on, left_on, right_on, left_index, right_index`** : to specify the columns or indexes on which to join.

> `how` : {"inner", "left", "right", "outer"}

>    * "left" : use keys from left frame only
>    * "right" : use keys from right frame only
>    * "inner" (default) : use intersection of keys from both frames
>    * "outer" : use union of keys from both frames

There are several cases to consider which are very important to understand:
- **one-to-one** joins: to define these relationships, only one table is necessary (no join)
    - one user **has** one phone number
    - one phone number **belongs to** one user
- **one-to-many** joins: to define these relationships, two tables are necessary 
    - one post **has** many comments
    - one comment **belongs to** one post
        - merge(left, right, on=['key'], how='?')
- **many-to-many** joins: to define these relationships, three tables are necessary
    - one playlist **has** many songs
    - one song **belongs to** many playlists
        - merge(left.reset_index(), right.reset_index(), on=['key'], how='?').set_index(['key_left','key_right'])

Below are the different joins in SQL.

![joins](http://i.stack.imgur.com/VQ5XP.png)

In [100]:
left = pd.DataFrame({'keyL': range(5), 
                           'left_value': ['L0', 'L1', 'L2', 'L3', 'L4']})
right = pd.DataFrame({'keyR': range(2, 7), 
                           'right_value': ['R0', 'R1', 'R2', 'R3', 'R4']})
print (left), '\n'
print (right)

   keyL left_value
0     0         L0
1     1         L1
2     2         L2
3     3         L3
4     4         L4
   keyR right_value
0     2          R0
1     3          R1
2     4          R2
3     5          R3
4     6          R4

In [101]:
left

   keyL left_value
0     0         L0
1     1         L1
2     2         L2
3     3         L3
4     4         L4

### 3.1 Inner Join (default)
Selects the rows from both tables with matching keys.

In [102]:
print (pd.merge(left, right, left_on='keyL', right_on='keyR', how='inner'))

   keyL left_value  keyR right_value
0     2         L2     2          R0
1     3         L3     3          R1
2     4         L4     4          R2

In [103]:
 print(pd.merge(left, right, left_on='keyL', right_on='keyR'))

   keyL left_value  keyR right_value
0     2         L2     2          R0
1     3         L3     3          R1
2     4         L4     4          R2

* If our key columns had *different names*, we could have used the **`left_on`** and **`right_on`** parameters to specify which fields to join from each frame.
```python
    pd.merge(left, right, left_on='left_key', right_on='right_key')
```
* If our key columns were *indexes*, we could use the **`left_index`** or **`right_index`** parameters to specify to use the index column, with a True/False value. You can mix and match columns and indexes like so:
```python
    pd.merge(left, right, left_on='key', right_index=True)
```

### 3.2 Left Outer Join
Returns all rows from the left frame, with the matching rows in the right frame. The result is `NULL` in the right side when there is no match (NaN).

In [104]:
print (pd.merge(left, right, left_on='keyL', right_on='keyR', how='left'))

   keyL left_value  keyR right_value
0     0         L0   NaN         NaN
1     1         L1   NaN         NaN
2     2         L2   2.0          R0
3     3         L3   3.0          R1
4     4         L4   4.0          R2

### 3.3 Right Outer Join
Returns all rows from the right frame, with the matching rows in the left frame. The result is NULL in the left side when there is no match (NaN).

In [105]:
print (pd.merge(left, right, left_on='keyL', right_on='keyR', how='right'))

   keyL left_value  keyR right_value
0   2.0         L2     2          R0
1   3.0         L3     3          R1
2   4.0         L4     4          R2
3   NaN        NaN     5          R3
4   NaN        NaN     6          R4

### 3.4 Full Outer Join
Combines the result of both Left Outer Join et Right Outer Join.

In [106]:
print (pd.merge(left, right, left_on='keyL', right_on='keyR', how='outer'))

   keyL left_value  keyR right_value
0   0.0         L0   NaN         NaN
1   1.0         L1   NaN         NaN
2   2.0         L2   2.0          R0
3   3.0         L3   3.0          R1
4   4.0         L4   4.0          R2
5   NaN        NaN   5.0          R3
6   NaN        NaN   6.0          R4

## 4. Concatenate

Use pandas **`.concat()`** static method to combine Series/DataFrames into one unified object. 
`pandas.concat()` takes a list of Series or DataFrames and returns a Series or DataFrame of the concatenated objects. Note that because the function takes list, you can combine many objects at once.

Use `axis` parameter to define along which axis to concatenate:
>    `axis` = 0 : concatenate vertically (default)<br>
>    `axis` = 1 : concatenante side-by-side

In [107]:
left

   keyL left_value
0     0         L0
1     1         L1
2     2         L2
3     3         L3
4     4         L4

In [108]:
right

   keyR right_value
0     2          R0
1     3          R1
2     4          R2
3     5          R3
4     6          R4

In [109]:
pd.concat([left, right], axis=1)

   keyL left_value  keyR right_value
0     0         L0     2          R0
1     1         L1     3          R1
2     2         L2     4          R2
3     3         L3     5          R3
4     4         L4     6          R4

In [110]:
pd.concat([left, right], axis=0)

   keyL left_value  keyR right_value
0   0.0         L0   NaN         NaN
1   1.0         L1   NaN         NaN
2   2.0         L2   NaN         NaN
3   3.0         L3   NaN         NaN
4   4.0         L4   NaN         NaN
0   NaN        NaN   2.0          R0
1   NaN        NaN   3.0          R1
2   NaN        NaN   4.0          R2
3   NaN        NaN   5.0          R3
4   NaN        NaN   6.0          R4